# conftest.py
"""Файл conftest.py для хранения фикстур"""

import os
from math import nan

import pandas as pd
import pytest


@pytest.fixture
def fix_data_df():
    """Фикстура тестового DataFrame."""
    data = {
        "Дата операции": ["01.01.2021", "02.01.2021", "03.01.2021", "04.01.2021", "05.01.2021"],
        "Сумма операции с округлением": [100, 200, 150, 300, 250],
    }
    return pd.DataFrame(data)


@pytest.fixture
def fix_tzs_date() -> list:
    """Фикстура трансакций в листе"""
    small_list = [
        {
            "Дата операции": "01.05.2021 20:20:45",
            "Дата платежа": "01.05.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -326.31,
            "Валюта операции": "RUB",
            "Сумма платежа": -326.31,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 6,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 326.31,
        },
        {
            "Дата операции": "01.05.2021 20:12:43",
            "Дата платежа": "01.05.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -128.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -128.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 128.0,
        },
        {
            "Дата операции": "01.05.2021 15:52:08",
            "Дата платежа": "01.05.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -11.8,
            "Валюта операции": "RUB",
            "Сумма платежа": -11.8,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 11.8,
        },
        {
            "Дата операции": "01.05.2021 13:57:31",
            "Дата платежа": "01.05.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -64.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -64.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "McDonald's",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 64.0,
        },
        {
            "Дата операции": "01.05.2021 12:49:30",
            "Дата платежа": "01.05.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -1675.8,
            "Валюта операции": "RUB",
            "Сумма платежа": -1675.8,
            "Валюта платежа": "RUB",
            "Кэшбэк": 83.0,
            "Категория": "Ж/д билеты",
            "MCC": 4112.0,
            "Описание": "РЖД",
            "Бонусы (включая кэшбэк)": 83,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 1675.8,
        },
        {
            "Дата операции": "01.05.2021 12:25:11",
            "Дата платежа": "01.05.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -53.99,
            "Валюта операции": "RUB",
            "Сумма платежа": -53.99,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 53.99,
        },
        {
            "Дата операции": "01.05.2021 12:16:18",
            "Дата платежа": "01.05.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -149.97,
            "Валюта операции": "RUB",
            "Сумма платежа": -149.97,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Дикси",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 149.97,
        },
        {
            "Дата операции": "01.05.2021 12:02:15",
            "Дата платежа": "01.05.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -146.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -146.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 146.0,
        },
    ]
    return small_list


@pytest.fixture
def fix_user_settings_dict() -> dict:
    """Фикстура конфиг настроек"""
    config_dict = {"user_currencies": ["USD", "EUR"], "user_stocks": ["SBER", "YDEX", "VTBR", "OZON", "VKCO"]}
    return config_dict


@pytest.fixture
def project_root() -> str:
    """Возвращает корневой путь проекта (папка sky_bank)"""
    current_dir = os.path.dirname(__file__)  # директория tests/
    return os.path.dirname(current_dir)  # директ проекта


@pytest.fixture
def fix_path_file_json(project_root) -> str:
    """Путь к файлу user_settings.json"""
    path_file_json = os.path.join(project_root, "user_settings.json")
    return path_file_json


@pytest.fixture
def fix_path_file_xlsx(project_root) -> str:
    """Путь к файлу operations.xlsx"""
    path_file_xlsx = os.path.join(project_root, "data", "operations.xlsx")
    return path_file_xlsx
