# views.py
"""Модуль набора основных функций выдающих информацию для главной страницы"""

import os
from math import nan

from src.data_extract import get_convert_data_in_json, get_convert_json_in_data
from src.main_page.external_api import get_current_exchange_rate, get_current_stock_price
from src.main_page.utils import get_count_carts, get_sort_by_date, get_status_time_message, get_tzs_filter_date


def get_main_page(tzs: list, date: str, config_user: dict) -> dict:
    result: dict = {}

    # Приветствие
    result["greeting"] = get_status_time_message()

    # По каждой карте
    tzs_filter_datetime: list = get_tzs_filter_date(tzs, date)
    unique_date: list = get_count_carts(tzs_filter_datetime)
    result["cards"] = unique_date

    # Топ транзакций по сумме платежа в указанный период
    result["top_transactions"] = get_sort_by_date(tzs_filter_datetime)

    # Курс валют
    currency_codes: list[str] = config_user["user_currencies"]
    result["currency_rates"] = get_current_exchange_rate(currency_codes)
    # Если будет блокироватся ответ по API, уст. тайм слип или Asing библиотека по потокам.
    # Стоимость акций
    stock_codes: list[str] = config_user["user_stocks"]
    result["stock_prices"] = get_current_stock_price(stock_codes)

    get_convert_data_in_json(result, "main_page.json")
    return result


if __name__ == "__main__":  # pragma: no cover
    # Директории
    project_root = os.path.dirname(os.path.dirname(os.path.dirname(__file__)))  # директ проекта
    path_file_xlsx = os.path.join(project_root, "data", "operations.xlsx")
    path_file_json = os.path.join(project_root, "user_settings.json")

    # Вводные данные
    # transactions = get_data_xlsx(path_file_xlsx)
    transactions = [
        {
            "Дата операции": "01.05.2021 20:20:45",
            "Дата платежа": "01.05.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -326.31,
            "Валюта операции": "RUB",
            "Сумма платежа": -326.31,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 6,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 326.31,
        },
        {
            "Дата операции": "01.05.2021 20:12:43",
            "Дата платежа": "01.05.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -128.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -128.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 128.0,
        },
        {
            "Дата операции": "01.05.2021 15:52:08",
            "Дата платежа": "01.05.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -11.8,
            "Валюта операции": "RUB",
            "Сумма платежа": -11.8,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 11.8,
        },
        {
            "Дата операции": "01.05.2021 13:57:31",
            "Дата платежа": "01.05.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -64.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -64.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "McDonald's",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 64.0,
        },
        {
            "Дата операции": "01.05.2021 12:49:30",
            "Дата платежа": "01.05.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -1675.8,
            "Валюта операции": "RUB",
            "Сумма платежа": -1675.8,
            "Валюта платежа": "RUB",
            "Кэшбэк": 83.0,
            "Категория": "Ж/д билеты",
            "MCC": 4112.0,
            "Описание": "РЖД",
            "Бонусы (включая кэшбэк)": 83,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 1675.8,
        },
        {
            "Дата операции": "01.05.2021 12:25:11",
            "Дата платежа": "01.05.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -53.99,
            "Валюта операции": "RUB",
            "Сумма платежа": -53.99,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 53.99,
        },
        {
            "Дата операции": "01.05.2021 12:16:18",
            "Дата платежа": "01.05.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -149.97,
            "Валюта операции": "RUB",
            "Сумма платежа": -149.97,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Дикси",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 149.97,
        },
        {
            "Дата операции": "01.05.2021 12:02:15",
            "Дата платежа": "01.05.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -146.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -146.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 146.0,
        },
    ]
    date_filter = "02.05.2021"
    config = get_convert_json_in_data(path_file_json)
    # print(type(config))
    data_page = get_main_page(transactions, date_filter, config)
    # print(data_page)
    for k, v in data_page.items():
        print(f"{k}: {v}")
